erlang/erlang-notes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Erlang notes for AP</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-10-23 09:25:26 CEST"/>
<meta name="author" content=""/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
</head>
<body>
<div id="content">

<h1 class="title">Erlang notes for AP</h1>

<p>Small collection of useful Erlang resources, collected throughout the course Advanced Programming.
</p>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Online resources </a></li>
<li><a href="#sec-2">2 Map-Reduce </a></li>
<li><a href="#sec-3">3 Exercises </a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Online resources </h2>
<div class="outline-text-2" id="text-1">

<dl>
<dt><a href="http://www.erlang.org/doc/index.html">http://www.erlang.org/doc/index.html</a></dt><dd>
The official documentation
</dd>
<dt><a href="http://erldocs.com/R15B/">http://erldocs.com/R15B/</a></dt><dd>
Has a nice search function
</dd>
<dt><a href="http://www.cis.upenn.edu/~matuszek/General/ConciseGuides/concise-erlang.html">A Concise Guide to Erlang</a></dt><dd>
Good overview of syntax
</dd>
<dt><a href="http://www.erlang.org/course/sequential_programming.html">http://www.erlang.org/course/sequential_programming.html</a></dt><dd>
Another concise overview
</dd>
<dt><a href="http://learnyousomeerlang.com/">Learn You Some Erlang for Great Good!</a></dt><dd>
Thorough introduction to the language
<ul>
</ul>
</dd>
</dl>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Map-Reduce </h2>
<div class="outline-text-2" id="text-2">

<dl>
<dt><a href="http://horicky.blogspot.dk/2008/06/exploring-erlang-with-mapreduce.html">http://horicky.blogspot.dk/2008/06/exploring-erlang-with-mapreduce.html</a></dt><dd>
Some guy doing something with Erlang and Map-Reduce.
<ul>
</ul>
</dd>
</dl>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Exercises </h2>
<div class="outline-text-2" id="text-3">

<dl>
<dt><a href="http://www.erlang.org/course/exercises.html">http://www.erlang.org/course/exercises.html</a></dt><dd>
Exercises

</dd>
</dl>
</div>
</div>
<div id="postamble">
<p class="author"> Author: 
<a href="mailto:">&lt;&gt;</a>
</p>
<p class="date"> Date: 2012-10-23 09:25:26 CEST</p>
<p class="creator">HTML generated by org-mode 6.33x in emacs 23</p>
</div>
</div>
</body>
</html>
